cask_args appdir: '/Applications'

brew tap caskroom/cask
brew tap caskroom/fonts
brew tap heroku/brew
brew tap thoughtbot/formulae


# install desired scripts
brew 'awscli'
brew 'clojure'
brew 'emacs'
brew 'fzf'
brew 'git'
brew 'leiningen'
brew 'maven'
brew 'node'
brew 'nvm'
brew 'rbenv'
brew 'ripgrep'
brew 'ruby'
brew 'ruby-build'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'watchman'
brew 'wget'
brew 'yarn' --without-node
brew 'z'
brew 'zsh'

cask 'caffeine'
cask 'divvy'
cask 'docker'
cask 'docker-toolbox'
cask 'google-chrome'
cask 'firefox'
cask 'flux'
cask 'intellij-idea-ce'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'macdown'
cask 'remembear'
cask 'slack'
cask 'sourcetree'
cask 'spotify'
cask 'skype'
cask 'superduper'
cask 'vlc'
cask 'visual-studio-code'
cask 'whatsapp'

