cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'mas-cli/tap'
# tap 'heroku/brew'
tap 'thoughtbot/formulae'

# pre-required casks
cask 'java'

# install desired scripts
brew 'awscli'
brew 'circleci'
brew 'clojure'
# brew 'emacs'
brew 'fzf'
brew 'git-standup'
brew 'hub'
brew 'hugo'
brew 'kubernetes-helm'
brew 'kubectl'
brew 'leiningen'
brew 'maven'
brew 'minikube'
brew 'node'
brew 'nvm'
brew 'pgweb'
brew 'postgresql'
# brew 'rbenv'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
# brew 'ruby'
# brew 'ruby-build'
brew 'tmux'
brew 'tfenv'
brew 'tree'
brew 'vim'
brew 'watchman'
brew 'wget'
brew 'yarn'
brew 'z'
brew 'zplug'
brew 'zsh'

cask 'the-unarchiver'
cask 'caffeine'
cask 'discord'
cask 'docker'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'firefox-developer-edition'
cask 'flux'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'keybase'
cask 'miro-formerly-realtimeboard'
cask 'macdown'
cask 'muzzle'
cask 'postman'
cask 'pgadmin4'
cask 'remembear'
cask 'robo-3t'
cask 'slack'
cask 'spotify'
cask 'skitch'
cask 'skype'
cask 'spectacle'
cask 'superduper'
cask 'telegram-desktop'
cask 'tunnelblick'
cask 'vlc'
cask 'visual-studio-code'
cask 'whatsapp'

# Fonts
cask 'font-roboto'
cask 'font-fira-code'
cask 'font-jetbrains-mono'
cask 'font-hasklig'
cask 'font-lato'            
cask 'font-roboto'          
cask 'font-roboto-condensed'

# Recommended apps
# cask 'omnifocus'

