cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'heroku/brew'
tap 'thoughtbot/formulae'

# pre-required casks
cask 'java'

# install desired scripts
brew 'awscli'
brew 'clojure'
brew 'emacs'
brew 'fzf'
brew 'git'
brew 'hub'
brew 'leiningen'
brew 'maven'
brew 'node'
brew 'nvm'
brew 'pgweb'
brew 'rbenv'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'ruby'
brew 'ruby-build'
brew 'tmux'
brew 'tfenv'
brew 'tree'
brew 'vim'
brew 'watchman'
brew 'wget'
brew 'yarn'
brew 'z'
brew 'zsh'

cask 'caffeine'
cask 'docker'
cask 'docker-toolbox'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'firefox'
cask 'flux'
cask 'intellij-idea-ce'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'macdown'
cask 'muzzle'
cask 'pgadmin4'
cask 'remembear'
cask 'slack'
cask 'sourcetree'
cask 'spotify'
cask 'skitch'
cask 'skype'
cask 'spectacle'
cask 'superduper'
cask 'vlc'
cask 'visual-studio-code'
cask 'whatsapp'

# Fonts
cask 'font-roboto'
cask 'font-fira-code'

# Recommended apps
# cask 'omnifocus'

